import{_ as u}from"./BBDtN1_I.js";import{_ as d}from"./Bs2uC9Nz.js";import{_ as k}from"./DkHkKbXF.js";import{_ as w}from"./D7wWbiUt.js";import{u as z}from"./CKiHXdGk.js";import{c as i,a,b as o,F as c,r as l,o as s,w as j,d as x,t as b}from"./NOylhoNW.js";const S={class:"relative"},f={class:"relative center justify-center xl:pb-16 xl:px-0 pb-6 px-4 z-10"},y={class:"section"},M={class:"second-grid xl:grid-cols-3 grid-cols-2"},C={class:"section bg-slate-100"},_={class:"second-grid grid-cols-2 sm:grid-cols-2 lg:grid-cols-3 mb-4"},H=["src","alt"],O={__name:"index",setup(V){z({title:"Servis japanskih vozila - Profesionalni auto servis | Nacional Auto",meta:[{name:"description",content:"Profesionalni servis i održavanje japanskih vozila. Servisiramo sve modele uz originalne delove i kvalitetne popravke."},{name:"keywords",content:"Auto servis, japanska vozila, dijagnostika, održavanje"},{property:"og:title",content:"Profesionalni servis japanskih vozila"},{property:"og:description",content:"Pružamo vrhunsku uslugu servisa za sve japanske modele, uz stručnost i originalne delove."},{property:"og:type",content:"website"},{property:"og:image",content:"/images/nacional-auto-logo.png"}],link:[{rel:"canonical",href:"https://www.nacionalauto.com/servis-japanskih-vozila"}],script:[{type:"application/ld+json",json:{"@context":"https://schema.org","@type":"AutoRepair",name:"Servis japanskih vozila - Nacional Auto",description:"Profesionalni servis i održavanje japanskih vozila.",url:"https://www.nacionalauto.com/servis-japanskih-vozila",image:"https://www.nacionalauto.com/images/nacional-auto-logo.png",telephone:"+381 11 35 11 528",address:{"@type":"PostalAddress",streetAddress:"Borska 94C",addressLocality:"Beograd",addressRegion:"RS",postalCode:"11000",addressCountry:"RS"},openingHoursSpecification:[{"@type":"OpeningHoursSpecification",dayOfWeek:["Monday","Tuesday","Wednesday","Thursday","Friday"],opens:"09:00",closes:"17:00"},{"@type":"OpeningHoursSpecification",dayOfWeek:["Saturday"],opens:"09:00",closes:"14:00"},{"@type":"OpeningHoursSpecification",dayOfWeek:["Sunday"],opens:"00:00",closes:"00:00"}],contactPoint:[{"@type":"ContactPoint",telephone:"+381 11 35 11 528",contactType:"customer service",areaServed:"RS",availableLanguage:"Serbian"},{"@type":"ContactPoint",telephone:"+381 11 30 57 430",contactType:"customer service",areaServed:"RS",availableLanguage:"Serbian"},{"@type":"ContactPoint",telephone:"+381 11 30 57 431",contactType:"customer service",areaServed:"RS",availableLanguage:"Serbian"},{"@type":"ContactPoint",telephone:"+381 63 256 412",contactType:"customer service",areaServed:"RS",availableLanguage:"Serbian"},{"@type":"ContactPoint",email:"office@nacionalauto.com",contactType:"customer service",areaServed:"RS",availableLanguage:"Serbian"}]}}]});const r=[{name:"toyota",imgSrc:"/images/logos/toyota.png",alt:"Toyota car logo"},{name:"honda",imgSrc:"/images/logos/honda.png",alt:"Honda car logo"},{name:"mazda",imgSrc:"/images/logos/mazda.png",alt:"Mazda car logo"},{name:"nissan",imgSrc:"/images/logos/nissan.png",alt:"Nissan car logo"},{name:"mitsubishi",imgSrc:"/images/logos/mitsubishi.png",alt:"Mitsubishi car logo"},{name:"suzuki",imgSrc:"/images/logos/suzuki.png",alt:"Suzuki car logo"},{name:"subaru",imgSrc:"/images/logos/subaru.png",alt:"Subaru car logo"},{name:"daihatsu",imgSrc:"/images/logos/daihatsu.png",alt:"Daihatsu car logo"},{name:"isuzu",imgSrc:"/images/logos/isuzu.png",alt:"Isuzu car logo"}],p=[{icon:`<svg fill="#000000" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 width="w-full" height="h-full" viewBox="0 0 236 256" enable-background="new 0 0 236 256" xml:space="preserve">
<path d="M117.5,2c-12.47,0-22.63,10.16-22.63,22.63c0,12.46,10.06,22.62,22.63,22.62c12.37,0,22.62-10.16,22.62-22.62
	C140.12,12.16,129.97,2,117.5,2z M146,52H89c-15.59,0-28,13.41-28,29v32h20V86c0-1.71,1.29-3,3-3s3,1.29,3,3v27h61V86
	c0-1.71,1.29-3,3-3s3,1.29,3,3v27h20V81C174,65.51,161.49,52,146,52z M2,118v27h23v109h185V145h24v-27H2z M136.06,206.81
	c1.03-0.34,2.02-0.58,3.05-0.58c3.05-0.11,5.66,0.82,7.88,2.84c2.23,1.99,3.43,4.45,3.5,7.57c0.1,0.93,0,2.02-0.24,3.05l-8.74-8.05
	l-7.88,8.6l8.84,8.02c-1.03,0.34-2.02,0.58-3.05,0.58c-3.05,0.11-5.65-0.82-7.88-2.84c-2.23-2.13-3.43-4.59-3.53-7.64
	c0-1.07,0.1-2.27,0.34-3.29l-2.12-2.03l-12.72-11.61l-21.52,23.71c-1.3,1.75-3.32,2.95-5.65,2.95c-3.77,0-6.82-3.05-6.82-6.82
	c0-2.02,0.79-3.87,2.33-5.18l22.34-23.16l-13.5-12.37c-1.06,0.48-2.26,0.72-3.29,0.72c-3.05,0.1-5.65-0.82-7.88-2.85
	c-2.23-2.02-3.43-4.49-3.53-7.54c-0.1-0.92,0-2.02,0.24-3.05l8.84,8.02l7.81-8.56l-8.84-8.02c0.93-0.35,2.02-0.59,3.05-0.59
	c3.05-0.1,5.66,0.83,7.88,2.85c2.23,1.99,3.43,4.59,3.53,7.64c0.11,1.03,0,2.02-0.24,3.05l13.92,12.75l10.17-11l-15.21-13.4
	l13.81-15.73l39.1,34.41l-13.81,15.73l-15.63-13.78l-9.83,11.62L136.06,206.81z"/>
</svg>`,title:"Redovan Servis i Održavanje",description:"Redovni pregledi i održavanje ključni su za dugovečnost vašeg vozila. Nudimo zamenu ulja, filtera, svećica, kao i ostalih potrošnih materijala, kako bi vaš automobil uvek bio u najboljem stanju."},{icon:`<svg fill="#000000" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 width="w-full" height="h-full" viewBox="0 0 208 256" enable-background="new 0 0 208 256" xml:space="preserve">
<path d="M50.452,221.871v16.064c0,8.982-7.255,16.064-16.064,16.064s-16.064-7.082-16.064-16.064v-16.064H2.086v-52.512l0,0
	c0-11.573,7.773-21.074,18.31-24.01l18.828-44.739c2.764-6.564,9.155-11.228,16.755-11.228h96.214c7.6,0,13.992,4.664,16.755,11.228
	l18.656,44.739c10.537,2.937,18.31,12.437,18.31,24.01l0,0v52.512h-16.41v16.064c0,8.982-7.255,16.064-16.064,16.064
	c-8.982,0-16.064-7.082-16.064-16.064v-16.064H50.452z M35.424,193.024c8.982,0,16.237-7.255,16.237-16.237
	c0-8.982-7.255-16.237-16.237-16.237s-16.237,7.255-16.237,16.237S26.441,193.024,35.424,193.024 M187.777,176.787
	c0-8.982-7.255-16.237-16.237-16.237c-8.982,0-16.237,7.255-16.237,16.237s7.255,16.237,16.237,16.237
	C180.522,193.024,187.777,185.769,187.777,176.787 M171.54,144.485l-16.064-38.693c-0.691-1.9-2.591-3.282-4.837-3.282H57.361
	c-2.073,0-3.973,1.382-4.664,3.282l-16.064,38.693H171.54z M33.867,46.68h93.989c0.558,0,1.107-0.037,1.648-0.102
	c5.056,10.105,15.497,17.047,27.565,17.047c13.041,0,24.182-8.106,28.68-19.551h-28.68V21.551h28.68
	C181.252,10.106,170.112,2,157.07,2c-12.068,0-22.509,6.942-27.565,17.047c-0.541-0.065-1.091-0.102-1.648-0.102H33.867
	C26.24,18.945,20,25.185,20,32.812v0C20,40.439,26.24,46.68,33.867,46.68z"/>
</svg>`,title:"Mehaničke i Elektronske Popravke",description:"Naš tim stručnjaka specijalizovan je za sve vrste popravki motora i menjača, osiguravajući vrhunsku funkcionalnost i pouzdanost vašeg vozila."},{icon:`<svg fill="#000000" height="h-full" width="w-full" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 viewBox="0 0 512 512" xml:space="preserve">
<g>
	<g>
		<g>
			<path d="M115.307,229.513h13.815c0.309-1.201,0.786-2.33,1.218-3.478c0.212-0.565,0.353-1.156,0.591-1.704
				c0.847-1.942,1.845-3.796,3.01-5.544c0.265-0.388,0.591-0.724,0.865-1.103c0.962-1.333,1.986-2.604,3.125-3.787
				c0.521-0.539,1.086-1.006,1.633-1.51c1.015-0.927,2.048-1.81,3.169-2.613c0.653-0.477,1.324-0.909,2.013-1.333
				c1.139-0.715,2.313-1.342,3.531-1.924c0.733-0.344,1.448-0.689,2.198-0.98c1.351-0.53,2.745-0.936,4.175-1.307
				c0.689-0.168,1.342-0.397,2.039-0.53c2.154-0.406,4.352-0.671,6.621-0.671c2.269,0,4.467,0.265,6.621,0.671
				c0.697,0.132,1.351,0.362,2.039,0.53c1.43,0.371,2.825,0.777,4.175,1.307c0.75,0.291,1.465,0.636,2.198,0.98
				c1.218,0.583,2.392,1.209,3.531,1.924c0.689,0.424,1.359,0.856,2.013,1.333c1.121,0.803,2.154,1.686,3.169,2.613
				c0.547,0.503,1.112,0.971,1.633,1.51c1.139,1.183,2.163,2.454,3.125,3.787c0.274,0.38,0.6,0.715,0.865,1.103
				c1.165,1.748,2.163,3.602,3.01,5.544c0.238,0.547,0.38,1.139,0.591,1.704c0.433,1.148,0.909,2.278,1.218,3.478h72.863
				c0.309-1.201,0.786-2.33,1.218-3.478c0.212-0.565,0.353-1.156,0.591-1.704c0.847-1.942,1.845-3.796,3.01-5.544
				c0.265-0.388,0.591-0.724,0.865-1.103c0.962-1.333,1.986-2.604,3.125-3.787c0.521-0.539,1.086-1.006,1.633-1.51
				c1.015-0.927,2.048-1.81,3.169-2.613c0.653-0.477,1.324-0.909,2.013-1.333c1.139-0.715,2.313-1.342,3.531-1.924
				c0.733-0.344,1.448-0.689,2.198-0.98c1.351-0.53,2.745-0.936,4.175-1.307c0.689-0.168,1.342-0.397,2.039-0.53
				c2.154-0.406,4.352-0.671,6.621-0.671c2.269,0,4.467,0.265,6.621,0.671c0.697,0.132,1.351,0.362,2.039,0.53
				c1.43,0.371,2.825,0.777,4.175,1.307c0.75,0.291,1.465,0.636,2.198,0.98c1.218,0.583,2.392,1.209,3.531,1.924
				c0.689,0.424,1.359,0.856,2.013,1.333c1.121,0.803,2.154,1.686,3.169,2.613c0.547,0.503,1.112,0.971,1.633,1.51
				c1.139,1.183,2.163,2.454,3.125,3.787c0.274,0.38,0.6,0.715,0.865,1.103c1.165,1.748,2.163,3.602,3.01,5.544
				c0.238,0.547,0.38,1.139,0.591,1.704c0.433,1.148,0.909,2.278,1.218,3.478h13.815c2.737,0,4.961-2.216,4.961-4.952v-34.225
				c0-2.737-2.224-4.961-4.961-4.961h-21.522H136.829h-21.522c-2.737,0-4.961,2.225-4.961,4.961v34.225
				C110.346,227.297,112.571,229.513,115.307,229.513z"/>
			<path d="M285.803,128.405c-2.154-3.019-5.667-4.82-9.375-4.82H242.76v44.138h71.124L285.803,128.405z"/>
			<path d="M225.105,123.586h-33.66c-3.716,0-7.23,1.801-9.384,4.82l-28.081,39.318h71.124V123.586z"/>
			<path d="M163.312,220.69c-9.737,0-17.655,7.918-17.655,17.655c0,9.737,7.918,17.655,17.655,17.655s17.655-7.918,17.655-17.655
				C180.967,228.608,173.048,220.69,163.312,220.69z"/>
			<path d="M304.553,220.69c-9.737,0-17.655,7.918-17.655,17.655c0,9.737,7.918,17.655,17.655,17.655
				c9.737,0,17.655-7.918,17.655-17.655C322.208,228.608,314.29,220.69,304.553,220.69z"/>
			<polygon points="295.725,0 172.139,0 172.139,44.138 172.139,52.966 295.717,52.966 			"/>
			<path d="M419.312,52.966v220.716c13.215,5.526,25.141,13.497,35.31,23.287V26.483C454.622,11.882,442.74,0,428.139,0H313.381
				v35.31h88.276C411.393,35.31,419.312,43.229,419.312,52.966z"/>
			<path d="M375.174,494.345c-22.378,0-43.202-6.532-60.875-17.655H66.208c-9.737,0-17.655-7.918-17.655-17.655V52.966
				c0-9.737,7.918-17.655,17.655-17.655h88.276V0H39.725C25.125,0,13.243,11.882,13.243,26.483v459.034
				c0,14.601,11.882,26.483,26.483,26.483h335.448C375.174,512,377.981,494.345,375.174,494.345z"/>
			<path d="M66.209,459.033h226.348c-19.853-20.639-32.141-48.614-32.141-79.448c0-63.276,51.482-114.759,114.759-114.759
				c9.128,0,17.964,1.183,26.483,3.213V52.964h-88.276c0,9.737-7.927,17.655-17.655,17.655H172.14
				c-9.737,0-17.655-7.918-17.655-17.655H66.209V459.033z M92.692,190.339c0-12.465,10.143-22.616,22.607-22.616h16.993
				l35.407-49.576c5.464-7.645,14.336-12.217,23.737-12.217h84.983c9.41,0,18.282,4.573,23.746,12.217l35.407,49.576h16.984
				c12.473,0,22.616,10.152,22.616,22.616v34.225c0,12.465-10.143,22.607-22.616,22.607h-13.948
				c-3.946,15.192-17.646,26.483-34.057,26.483s-30.111-11.29-34.057-26.483h-73.128c-3.946,15.192-17.646,26.483-34.057,26.483
				c-16.41,0-30.111-11.29-34.057-26.483h-13.956c-12.465,0-22.607-10.143-22.607-22.607V190.339z M101.519,317.791h132.414
				c4.882,0,8.828,3.946,8.828,8.828c0,4.882-3.946,8.828-8.828,8.828H101.519c-4.882,0-8.828-3.946-8.828-8.828
				C92.692,321.737,96.638,317.791,101.519,317.791z M101.519,361.929h132.414c4.882,0,8.828,3.946,8.828,8.828
				c0,4.882-3.946,8.828-8.828,8.828H101.519c-4.882,0-8.828-3.946-8.828-8.828C92.692,365.875,96.638,361.929,101.519,361.929z
				 M101.519,406.067h132.414c4.882,0,8.828,3.946,8.828,8.828s-3.946,8.828-8.828,8.828H101.519c-4.882,0-8.828-3.946-8.828-8.828
				S96.638,406.067,101.519,406.067z"/>
			<path d="M496.332,497.099l-49.558-52.145c15.784-17.276,25.503-40.174,25.503-65.368c0-53.539-43.564-97.103-97.103-97.103
				s-97.103,43.564-97.103,97.103c0,53.539,43.564,97.103,97.103,97.103c22.007,0,42.258-7.442,58.562-19.836l49.796,52.392
				c1.739,1.836,4.061,2.754,6.4,2.754c2.189,0,4.37-0.803,6.073-2.428C499.546,506.218,499.687,500.621,496.332,497.099z
				 M375.174,459.034c-43.811,0-79.448-35.637-79.448-79.448c0-43.811,35.637-79.448,79.448-79.448
				c43.811,0,79.448,35.637,79.448,79.448C454.622,423.398,418.985,459.034,375.174,459.034z"/>
		</g>
	</g>
</g>
</svg>`,title:"Dijagnostika i Otklanjanje Problema",description:"Naša savremena dijagnostička oprema omogućava nam brzo prepoznavanje i otklanjanje problema, čime se minimizira vreme kada je vaš automobil van upotrebe."},{icon:`<svg fill="#000000" height="h-full" width="w-full" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 viewBox="0 0 511.682 511.682" xml:space="preserve">
<g>
	<g>
		<g>
			<path d="M107.787,275.816c5.524-90.256,77.761-162.484,168.017-168.008c11.39-0.683,20.3-10.294,20.3-21.854v-64
				c0-6.036-2.416-11.659-6.791-15.827S278.93-0.269,272.84,0.028C124.558,7.277,7.274,124.552,0.025,272.843
				c-0.287,6.09,1.94,12.099,6.117,16.483c4.159,4.365,9.773,6.773,15.809,6.773h63.973
				C97.493,296.098,107.087,287.188,107.787,275.816z"/>
			<path d="M278.138,179.329c-54.479,0-98.807,44.328-98.807,98.807c0,54.479,44.328,98.807,98.807,98.807
				c54.479,0,98.807-44.328,98.807-98.807C376.945,223.658,332.616,179.329,278.138,179.329z M278.138,206.277
				c4.958,0,8.982,4.024,8.982,8.982c0,4.958-4.024,8.982-8.982,8.982s-8.982-4.024-8.982-8.982
				C269.155,210.301,273.179,206.277,278.138,206.277z M215.261,287.119c-4.958,0-8.982-4.024-8.982-8.982s4.024-8.982,8.982-8.982
				c4.958,0,8.982,4.024,8.982,8.982S220.219,287.119,215.261,287.119z M278.138,349.996c-4.958,0-8.982-4.024-8.982-8.982
				c0-4.958,4.024-8.982,8.982-8.982s8.982,4.024,8.982,8.982C287.12,345.972,283.096,349.996,278.138,349.996z M278.138,314.066
				c-19.815,0-35.93-16.115-35.93-35.93c0-19.815,16.115-35.93,35.93-35.93c19.815,0,35.93,16.115,35.93,35.93
				C314.068,297.952,297.953,314.066,278.138,314.066z M341.015,287.119c-4.958,0-8.982-4.024-8.982-8.982s4.024-8.982,8.982-8.982
				c4.958,0,8.982,4.024,8.982,8.982S345.973,287.119,341.015,287.119z"/>
			<path d="M278.138,260.171c-9.908,0-17.965,8.057-17.965,17.965s8.057,17.965,17.965,17.965s17.965-8.057,17.965-17.965
				S288.045,260.171,278.138,260.171z"/>
			<path d="M314.068,47.431v38.517c0,21.055-16.33,38.535-37.178,39.801c-81.21,4.958-146.198,69.946-151.175,151.157
				c-1.276,20.848-18.764,37.16-39.783,37.16H47.432C64.661,426.805,161.294,511.68,278.138,511.68
				c128.781,0,233.544-104.771,233.544-233.544C511.682,161.292,426.806,64.659,314.068,47.431z M278.138,394.908
				c-64.386,0-116.772-52.386-116.772-116.772s52.386-116.772,116.772-116.772S394.91,213.75,394.91,278.136
				S342.524,394.908,278.138,394.908z"/>
		</g>
	</g>
</g>
</svg>`,title:"Servis Kočionog Sistema",description:"Pravilno funkcionisanje kočnica je ključno za vašu sigurnost. Pružamo usluge zamene kočionih pločica i diskova, kao i detaljan pregled i testiranje kočionog sistema."},{icon:`<svg fill="#000000" height="h-full" width="w-full" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 viewBox="0 0 512 512" xml:space="preserve">
<g>
	<g>
		<path d="M78.097,164.963c0,10.691,0,333.762,0,347.036h34.841c0-8.984,0-337.069,0-347.036H78.097z"/>
	</g>
</g>
<g>
	<g>
		<path d="M2.354,226.753v223.456c0,27.107,17.553,50.177,41.884,58.481c0-9.145,0-331.273,0-340.419
			C19.908,176.576,2.354,199.646,2.354,226.753z"/>
	</g>
</g>
<g>
	<g>
		<path d="M498.007,38.362L384.123,0.853c-8.853-2.919-18.446,1.887-21.376,10.784l-12.573,38.175
			c-2.925,8.88,1.903,18.45,10.784,21.376l10.313,3.397l-14.852,45.094h-4.124c-9.35,0-16.929,7.58-16.929,16.929
			c0,7.012,4.264,13.029,10.339,15.599l-10.474,31.801h-7.201c-9.35,0-16.929,7.58-16.929,16.929c0,8.04,5.61,14.756,13.124,16.485
			l-6.979,21.19l-10.313-3.397c-8.884-2.928-18.452,1.903-21.376,10.784l-12.573,38.174c-1.347,4.091-1.033,8.319,0.548,11.985
			h-83.164v-69.406c0-27.732-18.366-51.253-43.572-59.046c0,12.032,0,327.983,0,341.549c25.206-7.793,43.572-31.313,43.572-59.046
			v-69.406h91.231c12.273,14.973,30.901,24.547,51.728,24.547c35.136,0,64.007-27.244,66.65-61.714
			c8.388,1.497,16.443-3.432,19.053-11.361l12.573-38.175c2.925-8.88-1.903-18.451-10.784-21.376l-10.313-3.396l16.948-51.46h4.784
			c9.35,0,16.929-7.58,16.929-16.929c0-7.234-4.546-13.39-10.929-15.815l10.403-31.585h5.103c9.35,0,16.929-7.58,16.929-16.929
			c0-7.341-4.682-13.573-11.214-15.919l5.069-15.389l10.313,3.397c8.852,2.919,18.443-1.879,21.376-10.784l12.573-38.175
			C511.716,50.858,506.889,41.287,498.007,38.362z M333.328,371.492c-18.202,0-33.01-14.807-33.01-33.01
			c0-18.201,14.808-33.009,33.01-33.009c18.201,0,33.01,14.807,33.01,33.009C366.337,356.683,351.529,371.492,333.328,371.492z"/>
	</g>
</g>
</svg>`,title:"Servis Sistema Vešanja i Upravljanja",description:"Održavanje i popravka sistema vešanja i upravljanja doprinose stabilnosti i udobnosti vožnje. Naš tim se brine o ispravnosti amortizera, ležajeva, spona i drugih ključnih delova."},{icon:`<svg fill="#000000" height="h-full" width="w-full" version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 viewBox="0 0 236.732 236.732" xml:space="preserve">
<path d="M229.194,191.285h-5.021c-1.671,0-3.031-1.36-3.031-3.032V77.809c0-4.157-3.382-7.538-7.538-7.538h-13.73
	c-4.156,0-7.538,3.381-7.538,7.538v30.501h-17.832c0.034-0.263,0.057-0.529,0.057-0.8V77.439c0-4.307-1.331-11.052-2.966-15.036
	l-1.003-2.443h0.761c3.475,0,6.302-2.827,6.302-6.302v-3.527c0-2.977-2.053-5.137-4.881-5.137c-0.517,0-1.046,0.074-1.575,0.22
	l-5.984,1.648l-6.215-15.138c-1.762-4.288-6.965-7.776-11.6-7.776h-58.15c-4.637,0-9.841,3.489-11.601,7.777l-6.206,15.116
	l-5.908-1.627c-0.529-0.146-1.059-0.22-1.575-0.22c-2.828,0-4.881,2.161-4.881,5.137v3.527c0,3.475,2.827,6.302,6.302,6.302h0.677
	l-1.003,2.442c-1.636,3.983-2.967,10.728-2.967,15.036v30.071c0,0.271,0.023,0.538,0.057,0.8H44.397V77.809
	c0-4.157-3.382-7.538-7.538-7.538H23.13c-4.156,0-7.538,3.381-7.538,7.538v110.444c0,1.672-1.36,3.032-3.032,3.032h-5.02
	c-4.157,0-7.539,3.381-7.539,7.538v6.423c0,4.157,3.382,7.538,7.539,7.538H52.45c4.156,0,7.538-3.381,7.538-7.538v-6.423
	c0-4.157-3.382-7.538-7.538-7.538H47.43c-1.672,0-3.032-1.36-3.032-3.032v-64.087h147.939v64.087c0,1.672-1.36,3.032-3.032,3.032
	h-5.021c-4.156,0-7.538,3.381-7.538,7.538v6.423c0,4.157,3.382,7.538,7.538,7.538h44.911c4.156,0,7.538-3.381,7.538-7.538v-6.423
	C236.732,194.666,233.351,191.285,229.194,191.285z M162.434,76.928v8.569c0,1.386-1.134,2.521-2.52,2.521h-17.857
	c-1.387,0-2.52-1.134-2.52-2.521v-8.569c0-1.386,1.134-2.521,2.52-2.521h17.857C161.3,74.408,162.434,75.542,162.434,76.928z
	 M75.962,56.538l9.398-22.896c1.053-2.565,4.183-4.664,6.955-4.664h52.018c2.772,0,5.902,2.099,6.955,4.664l9.4,22.896
	c1.053,2.565-0.355,4.664-3.127,4.664H79.089C76.316,61.202,74.909,59.103,75.962,56.538z M74.048,76.928
	c0-1.386,1.135-2.521,2.521-2.521h17.855c1.386,0,2.521,1.134,2.521,2.521v8.569c0,1.386-1.135,2.521-2.521,2.521H76.568
	c-1.386,0-2.521-1.134-2.521-2.521V76.928z M82.923,107.51v-7.509h70.805v7.509c0,0.271,0.023,0.538,0.057,0.8H82.866
	C82.899,108.048,82.923,107.782,82.923,107.51z"/>
</svg>`,title:"Priprema za Tehnički Pregled",description:"Pripremamo vozilo za tehnički pregled kako bismo vam pomogli da ga bez problema prođete."}],v=t=>{const n=document.getElementById(t);n&&n.scrollIntoView({behavior:"smooth"})};return(t,n)=>{const g=u,h=d,m=k;return s(),i(c,null,[a("div",S,[n[3]||(n[3]=a("img",{src:w,alt:"Nacional Auto",class:"absolute inset-0 w-full h-full object-cover z-0"},null,-1)),o(g),a("div",f,[n[1]||(n[1]=a("h1",{class:"h1-text md:w-2/3"}," Servis Japanskih Vozila ",-1)),n[2]||(n[2]=a("h4",{class:"h4-hero-text md:w-2/3"}," U našem servisu specijalizovani smo za održavanje i popravku japanskih automobila, pružajući visokokvalitetne usluge prilagođene potrebama vlasnika svih vodećih japanskih brendova. ",-1)),a("button",{onClick:n[0]||(n[0]=e=>v("contact-us")),class:"hero-btn"}," Zakažite termin ")])]),a("div",y,[n[4]||(n[4]=a("h2",{class:"h2-text xl:mb-12 mb-4"}," Usluge koje pružamo ",-1)),a("div",M,[(s(),i(c,null,l(p,e=>o(h,{icon:e.icon,title:e.title,description:e.description},null,8,["icon","title","description"])),64))])]),a("div",C,[n[5]||(n[5]=a("div",{class:"center mb-4"},[a("h2",{class:"h2-text xl:mb-12 mb-4"}," Japanski Brendovi Koje Servisiramo "),a("h6",{class:"h6-text"}," Naš tim kvalifikovanih i iskusnih tehničara koristi najsavremeniju opremu i originalne ili OEM delove kako bi osigurao da vaš automobil radi savršeno, pružajući vam sigurnost i pouzdanost na putu. Nudimo kompletnu uslugu za sve popularne japanske brendove ")],-1)),a("div",_,[(s(),i(c,null,l(r,e=>o(m,{to:`/servis-japanskih-vozila/${e.name}`,class:"shadow-lg font-medium bg-black text-white py-2 px-4 flex items-center justify-center w-full uppercase"},{default:j(()=>[a("img",{src:e.imgSrc,alt:e.alt,class:"invert sm:h-[20px] h-[15px] sm:mr-4 mr-1"},null,8,H),x(" "+b(e.name),1)]),_:2},1032,["to"])),64))])])],64)}}};export{O as default};
